# Taps
tap "elastic/tap"
tap "hashicorp/tap"

# Core tools
brew "gh"
brew "direnv"
brew "python@3.13"
brew "python@3.14"
brew "pipx"
brew "uv"
brew "cookiecutter"

# Node — managed via nvm, but keep for tooling that needs a system node
brew "nvm"
brew "node"

# Cloud & infra
brew "awscli"
brew "colima"
brew "docker"
brew "docker-compose"
brew "hashicorp/tap/terraform"

# Data
brew "postgresql@18"
brew "redis"

# Code quality & diagramming
brew "graphviz"
brew "plantuml"

# Search
brew "elastic/tap/elasticsearch-full"

# Misc — yarn/pnpm managed via corepack; brew installs corepack itself
brew "corepack"

# GUI apps
cask "claude-code"
cask "font-hack-nerd-font"
cask "font-powerline-symbols"
cask "pgadmin4"
cask "sublime-text"
cask "visual-studio-code"
